Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/health_services_for_older_people/regulation_residential_care_older_people.html.txt.tmx
Source language: en
Languages: ga

source: Regulation of residential care for older people
ga: Rialú cúraim chónaithe do dhaoine scothaosta

source: The Health Information and Quality Authority (HIQA) is responsible for the registration and inspection of all residential care services for older people
ga: Is é an tÚdarás um Cháilíocht agus Eolas Sláinte atá freagrach as gach seirbhís cúraim chónaithe i gcomhair daoine scothaosta a chlárú agus as cigireacht a dhéanamh orthu

source: Services are required to meet certain standards that include rules about the quality of accommodation and care
ga: Ní mór do sheirbhísí caighdeáin airithe atá leagtha síos sa reachtaíocht a shásamh agus áirítear leo rialacha maidir le caighdeán na cóiríochta agus an chúraim

source: All services, including public as well as private and voluntary nursing homes, are subject to this independent registration and inspection
ga: Tá na seirbhísí go léir lena n-áirítear tithe altranais idir phoiblí, phríobháideach agus dheonach faoi réir an cheanglais seo maidir le clárú agus cigireacht neamhspleách

source: Before July 2009 the Health Service Executive (HSE) was responsible for the registration and inspection of private and voluntary residential care services and provided inspection reports up to that date
ga: Bhíodh Feidhmeannacht na Seirbhíse Sláinte (FSS) freagrach as clárú agus cigireacht a dhéanamh ar sheirbhísí cúraim chónaithe idir phríobháideach agus dheonach go dtí Iúil 2009 agus as tuarascálacha cigireachta go dtí an dáta sin a chur ar fáil

source: Services are only allowed to operate if they are registered by HIQA and they are inspected regularly to ensure that they maintain a high level of care
ga: Ní cheadaítear do sheirbhísí feidhmiú mura mbíonn siad cláraithe ag ÚCES agus déantar cigireacht orthu go rialta le cinntiú go gcuireann siad cúram ardchaighdeáin ar fáil i gcónaí

source: HIQA inspect residential services and re-register each centre every 3 years
ga: Déanann ÚCES cigireacht ar sheirbhísí cónaithe agus athchláraíonn sé gach ionad gach trí bliana

source: The inspections are a mixture of both announced and unannounced visits
ga: Bíonn cigireachtaí gan choinne agus cigireachtaí réamhfhógartha i gceist

source: These happen by day and also in the evenings, at weekends and at night
ga: Déantar iad i rith an lae agus san oíche, sa tráthnóna agus i rith an deireadh seachtaine

source: The registration and inspection process is completely independent and reports are published after every inspection
ga: Córas neamhspleách amach agus amach atá sa phróiseas cláraithe agus cigireachta agus foilsítear tuarascálacha tar éis gach cigireachta

source: These inspection reports provide information to the residents themselves, their families and the general public about the standards of care in individual centres
ga: Cuireann na cigireachtaí sin faisnéis ar fáil do na cónaitheoirí féin, dá dteaghlaigh agus don phobal i gcoitinne faoi chaighdeán an chúraim sna hionaid éagsúla

source: You can view the registers of residential centres for older people and the current inspection reports on the HIQA website
ga: Féadfaidh tú cláir na n-ionad cónaithe do dhaoine scothaosta agus na tuarascálacha cigireachta reatha a scrúdú ar láithreán gréasáin ÚCES

source: Before you go into residential care, a contract of care is agreed between you and the residential care service
ga: Is é an aidhm atá leis na Caighdeáin Náisiúnta Cáilíochta um Ionaid Cúraim Chónaithe do Dhaoine Scothaosta in Éirinn (pdf) ná cabhrú lena chinntiú go ndéantar freastal ar riachtanais daoine atá ina gcónaí i gcóiríocht chónaitheach

source: This contract sets out the terms that are to govern your care and welfare and must include details of the services to be provided and the fees to be charged
ga: Lena chois sin tá treoir maidir leis na caighdeáin (guide to the standards (pdf) agus bileog eolais maidir le clárú agus cigireacht (leaflet on registration and inspection) (pdf) ar fáil

source: The National Standards for Residential Care Settings for Older People in Ireland (pdf) are intended to help to ensure that the needs of people living in residential accommodation are met. There is also a guide to the standards (pdf)and a leaflet on registration and inspection (pdf)
ga: Cearta cónaitheoirí: Áirítear leo sin go mbeadh tú in ann faisnéis agus comhairle a fháil, go spreagfaí tú do thuairimí a nochtadh, go mbeadh ceart toilithe agat maidir le cóireáil agus cúram, ceart a bheith agat conradh i scríbhinn a dhéanamh srl

source: There are 35 standards which aim to help people participate in, and contribute to, daily life
ga: Cosaint cónaitheoirí: Áirítear leis sin cosaint ar bhulaíocht agus ar mhí-úsáid eile agus cosaint maidir leis an gcaoi a láimhseáiltear do chuid airgid

source: • Safeguarding and protecting people from abuse • Providing people with information and assessment so that appropriate supports are made available to meet their needs
ga: Cáilíocht na beatha: Áirítear leis sin go mbeadh rogha agat faoi do shaol agus iad faoi do thoil agat, agus rogha agat faoi do neamhspleáchas agus faoi theagmháil le cuairteoirí

source: The 35 standards are grouped into 8 themes
ga: Foireann: Áirítear leis seo cáilíochtaí na mball foirne agus go ndéanfaí grinnfhiosrúchán agus maoirsiú orthu

source: Four of the themes relate to quality and safety:
ga: An timpeallacht chúraim: Airítear leis seo an timpeallacht fhisiciúil, a bheith in ann dul amach faoin aer, sláinteachas agus earraí pearsanta

source: Four of the themes relate to the ability to deliver improvements in quality:
ga: Seirbhísí do dhaoine a bhfuil néaltrú orthu

source: • Leadership, governance and management
ga: Baineann siad sin le;

source: • Use of information Complaints
ga: • Cúram a sholáthar atá dírithe ar an duine féin

source: If you, a member of your family or someone acting on your behalf have concerns about your care, you should first try to resolve these at a local level, with the management of the care service
ga: • Leas a bhaint as teiripí agus teicnící a éascaíonn cumarsáid socruithe foirne, forbairtí cleachtais agus oiliúint foirne, agus • Dearadh fisiceach, leagan amach agus cumraíocht na n-aonad atá curtha ar fáil do dhaoine a bhfuil néaltrú orthu

source: Legislation states that all care providers must have procedures for handling complaints and must provide information about how you can make a complaint. If you are unhappy with the response you get from your provider or local HSE office, you can share this information with HIQA
ga: Má tá imní ortsa, nó ar bhall do theaghlaigh, nó ar dhuine atá ag gníomhú ar do shon faoin gcúram atá á fháil agat, ba chóir iarracht a dhéanamh an scéal a réiteach ar an leibhéal áitiúil le lucht bainistíochta na seirbhíse cúraim

source: HIQA do not have the power to investigate individual complaints but you can report any concerns you have to HIQA
ga: Conradh cúraim Déantar conradh cúraim idir tú féin agus an teach altranais sula dtéann tú isteach ann

source: HIQA can use the information to decide whether the service is meeting the national standards and regulations, and to check whether the service is meeting the needs of the people who live there
ga: Leagann an conradh sin síos na téarmaí a bhainfidh le do chúram agus le do leas agus ní mór go mbeadh sonraí ann faoi na seirbhísí atá le soláthar agus na táillí atá le gearradh

source: You can inspect the registers of residential centres for older people and the inspection reports on the HIQA website
ga: Féadfaidh tú cláir na n-ionad cónaitheach do dhaoine breacaosta agus tuarascálacha cigireachta reatha a scrúdú ar láithreán gréasáin ÚCES

source: Apply to individual residential care services for details of their cost and conditions
ga: Iarr ar thithe altranais faoi leith sonraí a thabhairt duit faoi na costais agus na coinníollacha a bhaineann leo

source: More information on the registration and inspection of residential care services, as well as on the National Standards, is available from HIQA
ga: Féadfaidh tú tuilleadh eolais faoi chlárú agus cigireacht tithe altranais agus faoi na Caighdeáin Náisiúnta a fháil ó ÚCES
